---
kind: method
id: M:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.GetLatestSystemsAnalysisReport(Autodesk.Revit.DB.Document)
source: html/e5aabba3-038a-3017-081b-9b1b82cf7872.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.GetLatestSystemsAnalysisReport Method

Gets the latest report of systems analysis.

## Syntax (C#)
```csharp
public static ElementId GetLatestSystemsAnalysisReport(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null